OpenEPaperLink/OpenEPaperLink/ARM_Tag_FW/cc2531_OEPL/contiki/sdcc/non-free/include/pic14/pic16lf1777.h
#define _DAC5CON0_NSS0          0x01
#define _DAC5CON0_DACNSS0       0x01
#define _DAC5CON0_DAC5NSS0      0x01
#define _DAC5CON0_NSS1          0x02
#define _DAC5CON0_DACNSS1       0x02
#define _DAC5CON0_DAC5NSS1      0x02
#define _DAC5CON0_PSS0          0x04
#define _DAC5CON0_DACPSS0       0x04
#define _DAC5CON0_DAC5PSS0      0x04
#define _DAC5CON0_PSS1          0x08
#define _DAC5CON0_DACPSS1       0x08
#define _DAC5CON0_DAC5PSS1      0x08
#define _DAC5CON0_OE2           0x10
#define _DAC5CON0_DACOE2        0x10
#define _DAC5CON0_DAC5OE2       0x10
#define _DAC5CON0_OE1           0x20
#define _DAC5CON0_OE            0x20
#define _DAC5CON0_DACOE1        0x20
#define _DAC5CON0_DACOE         0x20
#define _DAC5CON0_DAC5OE1       0x20
#define _DAC5CON0_FM            0x40
#define _DAC5CON0_DACFM         0x40
#define _DAC5CON0_DAC5FM        0x40
#define _DAC5CON0_EN            0x80
#define _DAC5CON0_DACEN         0x80
#define _DAC5CON0_DAC5EN        0x80

//==============================================================================


//==============================================================================
//        DAC5CON1 Bits

extern __at(0x0599) __sfr DAC5CON1;

typedef union
  {
  struct
    {
    unsigned REF0               : 1;
    unsigned REF1               : 1;
    unsigned REF2               : 1;
    unsigned REF3               : 1;
    unsigned REF4               : 1;
    unsigned REF5               : 1;
    unsigned REF6               : 1;
    unsigned REF7               : 1;
    };

  struct
    {
    unsigned DAC5REF0           : 1;
    unsigned DAC5REF1           : 1;
    unsigned DAC5REF2           : 1;
    unsigned DAC5REF3           : 1;
    unsigned DAC5REF4           : 1;
    unsigned DAC5REF5           : 1;
    unsigned DAC5REF6           : 1;
    unsigned DAC5REF7           : 1;
    };

  struct
    {
    unsigned R0                 : 1;
    unsigned R1                 : 1;
    unsigned R2                 : 1;
    unsigned R3                 : 1;
    unsigned R4                 : 1;
    unsigned R5                 : 1;
    unsigned R6                 : 1;
    unsigned R7                 : 1;
    };

  struct
    {
    unsigned DAC5R0             : 1;
    unsigned DAC5R1             : 1;
    unsigned DAC5R2             : 1;
    unsigned DAC5R3             : 1;
    unsigned DAC5R4             : 1;
    unsigned DAC5R5             : 1;
    unsigned DAC5R6             : 1;
    unsigned DAC5R7             : 1;
    };
  } __DAC5CON1bits_t;

extern __at(0x0599) volatile __DAC5CON1bits_t DAC5CON1bits;

#define _DAC5CON1_REF0          0x01
#define _DAC5CON1_DAC5REF0      0x01
#define _DAC5CON1_R0            0x01
#define _DAC5CON1_DAC5R0        0x01
#define _DAC5CON1_REF1          0x02
#define _DAC5CON1_DAC5REF1      0x02
#define _DAC5CON1_R1            0x02
#define _DAC5CON1_DAC5R1        0x02
#define _DAC5CON1_REF2          0x04
#define _DAC5CON1_DAC5REF2      0x04
#define _DAC5CON1_R2            0x04
#define _DAC5CON1_DAC5R2        0x04
#define _DAC5CON1_REF3          0x08
#define _DAC5CON1_DAC5REF3      0x08
#define _DAC5CON1_R3            0x08
#define _DAC5CON1_DAC5R3        0x08
#define _DAC5CON1_REF4          0x10
#define _DAC5CON1_DAC5REF4      0x10
#define _DAC5CON1_R4            0x10
#define _DAC5CON1_DAC5R4        0x10
#define _DAC5CON1_REF5          0x20
#define _DAC5CON1_DAC5REF5      0x20
#define _DAC5CON1_R5            0x20
#define _DAC5CON1_DAC5R5        0x20
#define _DAC5CON1_REF6          0x40
#define _DAC5CON1_DAC5REF6      0x40
#define _DAC5CON1_R6            0x40
#define _DAC5CON1_DAC5R6        0x40
#define _DAC5CON1_REF7          0x80
#define _DAC5CON1_DAC5REF7      0x80
#define _DAC5CON1_R7            0x80
#define _DAC5CON1_DAC5R7        0x80

//==============================================================================

extern __at(0x0599) __sfr DAC5REF;

//==============================================================================
//        DAC5REFL Bits

extern __at(0x0599) __sfr DAC5REFL;

typedef union
  {
  struct
    {
    unsigned REF0               : 1;
    unsigned REF1               : 1;
    unsigned REF2               : 1;
    unsigned REF3               : 1;
    unsigned REF4               : 1;
    unsigned REF5               : 1;
    unsigned REF6               : 1;
    unsigned REF7               : 1;
    };

  struct
    {
    unsigned DAC5REF0           : 1;
    unsigned DAC5REF1           : 1;
    unsigned DAC5REF2           : 1;
    unsigned DAC5REF3           : 1;
    unsigned DAC5REF4           : 1;
    unsigned DAC5REF5           : 1;
    unsigned DAC5REF6           : 1;
    unsigned DAC5REF7           : 1;
    };

  struct
    {
    unsigned R0                 : 1;
    unsigned R1                 : 1;
    unsigned R2                 : 1;
    unsigned R3                 : 1;
    unsigned R4                 : 1;
    unsigned R5                 : 1;
    unsigned R6                 : 1;
    unsigned R7                 : 1;
    };

  struct
    {
    unsigned DAC5R0             : 1;
    unsigned DAC5R1             : 1;
    unsigned DAC5R2             : 1;
    unsigned DAC5R3             : 1;
    unsigned DAC5R4             : 1;
    unsigned DAC5R5             : 1;
    unsigned DAC5R6             : 1;
    unsigned DAC5R7             : 1;
    };
  } __DAC5REFLbits_t;

extern __at(0x0599) volatile __DAC5REFLbits_t DAC5REFLbits;

#define _DAC5REFL_REF0          0x01
#define _DAC5REFL_DAC5REF0      0x01
#define _DAC5REFL_R0            0x01
#define _DAC5REFL_DAC5R0        0x01
#define _DAC5REFL_REF1          0x02
#define _DAC5REFL_DAC5REF1      0x02
#define _DAC5REFL_R1            0x02
#define _DAC5REFL_DAC5R1        0x02
#define _DAC5REFL_REF2          0x04
#define _DAC5REFL_DAC5REF2      0x04
#define _DAC5REFL_R2            0x04
#define _DAC5REFL_DAC5R2        0x04
#define _DAC5REFL_REF3          0x08
#define _DAC5REFL_DAC5REF3      0x08
#define _DAC5REFL_R3            0x08
#define _DAC5REFL_DAC5R3        0x08
#define _DAC5REFL_REF4          0x10
#define _DAC5REFL_DAC5REF4      0x10
#define _DAC5REFL_R4            0x10
#define _DAC5REFL_DAC5R4        0x10
#define _DAC5REFL_REF5          0x20
#define _DAC5REFL_DAC5REF5      0x20
#define _DAC5REFL_R5            0x20
#define _DAC5REFL_DAC5R5        0x20
#define _DAC5REFL_REF6          0x40
#define _DAC5REFL_DAC5REF6      0x40
#define _DAC5REFL_R6            0x40
#define _DAC5REFL_DAC5R6        0x40
#define _DAC5REFL_REF7          0x80
#define _DAC5REFL_DAC5REF7      0x80
#define _DAC5REFL_R7            0x80
#define _DAC5REFL_DAC5R7        0x80

//==============================================================================


//==============================================================================
//        DAC5CON2 Bits

extern __at(0x059A) __sfr DAC5CON2;

typedef union
  {
  struct
    {
    unsigned REF8               : 1;
    unsigned REF9               : 1;
    unsigned REF10              : 1;
    unsigned REF11              : 1;
    unsigned REF12              : 1;
    unsigned REF13              : 1;
    unsigned REF14              : 1;
    unsigned REF15              : 1;
    };

  struct
    {
    unsigned DAC5REF8           : 1;
    unsigned DAC5REF9           : 1;
    unsigned DAC5REF10          : 1;
    unsigned DAC5REF11          : 1;
    unsigned DAC5REF12          : 1;
    unsigned DAC5REF13          : 1;
    unsigned DAC5REF14          : 1;
    unsigned DAC5REF15          : 1;
    };

  struct
    {
    unsigned R8                 : 1;
    unsigned R9                 : 1;
    unsigned R10                : 1;
    unsigned R11                : 1;
    unsigned R12                : 1;
    unsigned R13                : 1;
    unsigned R14                : 1;
    unsigned R15                : 1;
    };

  struct
    {
    unsigned DAC5R8             : 1;
    unsigned DAC5R9             : 1;
    unsigned DAC5R10            : 1;
    unsigned DAC5R11            : 1;
    unsigned DAC5R12            : 1;
    unsigned DAC5R13            : 1;
    unsigned DAC5R14            : 1;
    unsigned DAC5R15            : 1;
    };
  } __DAC5CON2bits_t;

extern __at(0x059A) volatile __DAC5CON2bits_t DAC5CON2bits;

