OpenEPaperLink/OpenEPaperLink/ARM_Tag_FW/cc2531_OEPL/contiki/sdcc/non-free/include/pic14/pic16lf1777.h
#define _COG3FSIM1_FSIM9        0x02
#define _COG3FSIM1_G3FSIM9      0x02
#define _COG3FSIM1_FSIM11       0x08
#define _COG3FSIM1_G3FSIM11     0x08
#define _COG3FSIM1_FSIM12       0x10
#define _COG3FSIM1_G3FSIM12     0x10
#define _COG3FSIM1_FSIM13       0x20
#define _COG3FSIM1_G3FSIM13     0x20
#define _COG3FSIM1_FSIM14       0x40
#define _COG3FSIM1_G3FSIM14     0x40
#define _COG3FSIM1_FSIM15       0x80
#define _COG3FSIM1_G3FSIM15     0x80

//==============================================================================


//==============================================================================
//        COG3ASD0 Bits

extern __at(0x081D) __sfr COG3ASD0;

typedef union
  {
  struct
    {
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned ASDAC0             : 1;
    unsigned ASDAC1             : 1;
    unsigned ASDBD0             : 1;
    unsigned ASDBD1             : 1;
    unsigned ASREN              : 1;
    unsigned ASE                : 1;
    };

  struct
    {
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned G3ASDAC0           : 1;
    unsigned G3ASDAC1           : 1;
    unsigned G3ASDBD0           : 1;
    unsigned G3ASDBD1           : 1;
    unsigned ARSEN              : 1;
    unsigned G3ASE              : 1;
    };

  struct
    {
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned G3ARSEN            : 1;
    unsigned                    : 1;
    };

  struct
    {
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned G3ASREN            : 1;
    unsigned                    : 1;
    };

  struct
    {
    unsigned                    : 2;
    unsigned G3ASDAC            : 2;
    unsigned                    : 4;
    };

  struct
    {
    unsigned                    : 2;
    unsigned ASDAC              : 2;
    unsigned                    : 4;
    };

  struct
    {
    unsigned                    : 4;
    unsigned G3ASDBD            : 2;
    unsigned                    : 2;
    };

  struct
    {
    unsigned                    : 4;
    unsigned ASDBD              : 2;
    unsigned                    : 2;
    };
  } __COG3ASD0bits_t;

extern __at(0x081D) volatile __COG3ASD0bits_t COG3ASD0bits;

#define _COG3ASD0_ASDAC0        0x04
#define _COG3ASD0_G3ASDAC0      0x04
#define _COG3ASD0_ASDAC1        0x08
#define _COG3ASD0_G3ASDAC1      0x08
#define _COG3ASD0_ASDBD0        0x10
#define _COG3ASD0_G3ASDBD0      0x10
#define _COG3ASD0_ASDBD1        0x20
#define _COG3ASD0_G3ASDBD1      0x20
#define _COG3ASD0_ASREN         0x40
#define _COG3ASD0_ARSEN         0x40
#define _COG3ASD0_G3ARSEN       0x40
#define _COG3ASD0_G3ASREN       0x40
#define _COG3ASD0_ASE           0x80
#define _COG3ASD0_G3ASE         0x80

//==============================================================================


//==============================================================================
//        COG3ASD1 Bits

extern __at(0x081E) __sfr COG3ASD1;

typedef union
  {
  struct
    {
    unsigned AS0E               : 1;
    unsigned AS1E               : 1;
    unsigned AS2E               : 1;
    unsigned AS3E               : 1;
    unsigned AS4E               : 1;
    unsigned AS5E               : 1;
    unsigned AS6E               : 1;
    unsigned AS7E               : 1;
    };

  struct
    {
    unsigned G3AS0E             : 1;
    unsigned G3AS1E             : 1;
    unsigned G3AS2E             : 1;
    unsigned G3AS3E             : 1;
    unsigned G3AS4E             : 1;
    unsigned G3AS5E             : 1;
    unsigned G3AS6E             : 1;
    unsigned G3AS7E             : 1;
    };
  } __COG3ASD1bits_t;

extern __at(0x081E) volatile __COG3ASD1bits_t COG3ASD1bits;

#define _COG3ASD1_AS0E          0x01
#define _COG3ASD1_G3AS0E        0x01
#define _COG3ASD1_AS1E          0x02
#define _COG3ASD1_G3AS1E        0x02
#define _COG3ASD1_AS2E          0x04
#define _COG3ASD1_G3AS2E        0x04
#define _COG3ASD1_AS3E          0x08
#define _COG3ASD1_G3AS3E        0x08
#define _COG3ASD1_AS4E          0x10
#define _COG3ASD1_G3AS4E        0x10
#define _COG3ASD1_AS5E          0x20
#define _COG3ASD1_G3AS5E        0x20
#define _COG3ASD1_AS6E          0x40
#define _COG3ASD1_G3AS6E        0x40
#define _COG3ASD1_AS7E          0x80
#define _COG3ASD1_G3AS7E        0x80

//==============================================================================


//==============================================================================
//        COG3STR Bits

extern __at(0x081F) __sfr COG3STR;

typedef union
  {
  struct
    {
    unsigned STRA               : 1;
    unsigned STRB               : 1;
    unsigned STRC               : 1;
    unsigned STRD               : 1;
    unsigned SDATA              : 1;
    unsigned SDATB              : 1;
    unsigned SDATC              : 1;
    unsigned SDATD              : 1;
    };

  struct
    {
    unsigned G3STRA             : 1;
    unsigned G3STRB             : 1;
    unsigned G3STRC             : 1;
    unsigned G3STRD             : 1;
    unsigned G3SDATA            : 1;
    unsigned G3SDATB            : 1;
    unsigned G3SDATC            : 1;
    unsigned G3SDATD            : 1;
    };
  } __COG3STRbits_t;

extern __at(0x081F) volatile __COG3STRbits_t COG3STRbits;

#define _COG3STR_STRA           0x01
#define _COG3STR_G3STRA         0x01
#define _COG3STR_STRB           0x02
#define _COG3STR_G3STRB         0x02
#define _COG3STR_STRC           0x04
#define _COG3STR_G3STRC         0x04
#define _COG3STR_STRD           0x08
#define _COG3STR_G3STRD         0x08
#define _COG3STR_SDATA          0x10
#define _COG3STR_G3SDATA        0x10
#define _COG3STR_SDATB          0x20
#define _COG3STR_G3SDATB        0x20
#define _COG3STR_SDATC          0x40
#define _COG3STR_G3SDATC        0x40
#define _COG3STR_SDATD          0x80
#define _COG3STR_G3SDATD        0x80

//==============================================================================


//==============================================================================
//        COG4PHR Bits

