OpenEPaperLink/OpenEPaperLink/ARM_Tag_FW/cc2531_OEPL/contiki/sdcc/non-free/include/pic14/pic16lf1777.h
extern __at(0x089B) __sfr COG4FSIM0;

typedef union
  {
  struct
    {
    unsigned FSIM0              : 1;
    unsigned FSIM1              : 1;
    unsigned FSIM2              : 1;
    unsigned FSIM3              : 1;
    unsigned FSIM4              : 1;
    unsigned FSIM5              : 1;
    unsigned FSIM6              : 1;
    unsigned FSIM7              : 1;
    };

  struct
    {
    unsigned G4FSIM0            : 1;
    unsigned G4FSIM1            : 1;
    unsigned G4FSIM2            : 1;
    unsigned G4FSIM3            : 1;
    unsigned G4FSIM4            : 1;
    unsigned G4FSIM5            : 1;
    unsigned G4FSIM6            : 1;
    unsigned G4FSIM7            : 1;
    };
  } __COG4FSIM0bits_t;

extern __at(0x089B) volatile __COG4FSIM0bits_t COG4FSIM0bits;

#define _COG4FSIM0_FSIM0        0x01
#define _COG4FSIM0_G4FSIM0      0x01
#define _COG4FSIM0_FSIM1        0x02
#define _COG4FSIM0_G4FSIM1      0x02
#define _COG4FSIM0_FSIM2        0x04
#define _COG4FSIM0_G4FSIM2      0x04
#define _COG4FSIM0_FSIM3        0x08
#define _COG4FSIM0_G4FSIM3      0x08
#define _COG4FSIM0_FSIM4        0x10
#define _COG4FSIM0_G4FSIM4      0x10
#define _COG4FSIM0_FSIM5        0x20
#define _COG4FSIM0_G4FSIM5      0x20
#define _COG4FSIM0_FSIM6        0x40
#define _COG4FSIM0_G4FSIM6      0x40
#define _COG4FSIM0_FSIM7        0x80
#define _COG4FSIM0_G4FSIM7      0x80

//==============================================================================


//==============================================================================
//        COG4FSIM1 Bits

extern __at(0x089C) __sfr COG4FSIM1;

typedef union
  {
  struct
    {
    unsigned FSIM8              : 1;
    unsigned FSIM9              : 1;
    unsigned FSIM10             : 1;
    unsigned FSIM11             : 1;
    unsigned FSIM12             : 1;
    unsigned FSIM13             : 1;
    unsigned FSIM14             : 1;
    unsigned FSIM15             : 1;
    };

  struct
    {
    unsigned G4FSIM8            : 1;
    unsigned G4FSIM9            : 1;
    unsigned G4FSIM10           : 1;
    unsigned G4FSIM11           : 1;
    unsigned G4FSIM12           : 1;
    unsigned G4FSIM13           : 1;
    unsigned G4FSIM14           : 1;
    unsigned G4FSIM15           : 1;
    };
  } __COG4FSIM1bits_t;

extern __at(0x089C) volatile __COG4FSIM1bits_t COG4FSIM1bits;

#define _COG4FSIM1_FSIM8        0x01
#define _COG4FSIM1_G4FSIM8      0x01
#define _COG4FSIM1_FSIM9        0x02
#define _COG4FSIM1_G4FSIM9      0x02
#define _COG4FSIM1_FSIM10       0x04
#define _COG4FSIM1_G4FSIM10     0x04
#define _COG4FSIM1_FSIM11       0x08
#define _COG4FSIM1_G4FSIM11     0x08
#define _COG4FSIM1_FSIM12       0x10
#define _COG4FSIM1_G4FSIM12     0x10
#define _COG4FSIM1_FSIM13       0x20
#define _COG4FSIM1_G4FSIM13     0x20
#define _COG4FSIM1_FSIM14       0x40
#define _COG4FSIM1_G4FSIM14     0x40
#define _COG4FSIM1_FSIM15       0x80
#define _COG4FSIM1_G4FSIM15     0x80

//==============================================================================


//==============================================================================
//        COG4ASD0 Bits

extern __at(0x089D) __sfr COG4ASD0;

typedef union
  {
  struct
    {
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned ASDAC0             : 1;
    unsigned ASDAC1             : 1;
    unsigned ASDBD0             : 1;
    unsigned ASDBD1             : 1;
    unsigned ASREN              : 1;
    unsigned ASE                : 1;
    };

  struct
    {
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned G4ASDAC0           : 1;
    unsigned G4ASDAC1           : 1;
    unsigned G4ASDBD0           : 1;
    unsigned G4ASDBD1           : 1;
    unsigned ARSEN              : 1;
    unsigned G4ASE              : 1;
    };

  struct
    {
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned G4ARSEN            : 1;
    unsigned                    : 1;
    };

  struct
    {
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned G4ASREN            : 1;
    unsigned                    : 1;
    };

  struct
    {
    unsigned                    : 2;
    unsigned G4ASDAC            : 2;
    unsigned                    : 4;
    };

  struct
    {
    unsigned                    : 2;
    unsigned ASDAC              : 2;
    unsigned                    : 4;
    };

  struct
    {
    unsigned                    : 4;
    unsigned G4ASDBD            : 2;
    unsigned                    : 2;
    };

  struct
    {
    unsigned                    : 4;
    unsigned ASDBD              : 2;
    unsigned                    : 2;
    };
  } __COG4ASD0bits_t;

extern __at(0x089D) volatile __COG4ASD0bits_t COG4ASD0bits;

#define _COG4ASD0_ASDAC0        0x04
#define _COG4ASD0_G4ASDAC0      0x04
#define _COG4ASD0_ASDAC1        0x08
#define _COG4ASD0_G4ASDAC1      0x08
#define _COG4ASD0_ASDBD0        0x10
#define _COG4ASD0_G4ASDBD0      0x10
#define _COG4ASD0_ASDBD1        0x20
#define _COG4ASD0_G4ASDBD1      0x20
#define _COG4ASD0_ASREN         0x40
#define _COG4ASD0_ARSEN         0x40
#define _COG4ASD0_G4ARSEN       0x40
#define _COG4ASD0_G4ASREN       0x40
#define _COG4ASD0_ASE           0x80
#define _COG4ASD0_G4ASE         0x80

//==============================================================================


//==============================================================================
//        COG4ASD1 Bits

extern __at(0x089E) __sfr COG4ASD1;

typedef union
  {
  struct
    {
    unsigned AS0E               : 1;
    unsigned AS1E               : 1;
    unsigned AS2E               : 1;
    unsigned AS3E               : 1;
    unsigned AS4E               : 1;
    unsigned AS5E               : 1;
    unsigned AS6E               : 1;
    unsigned AS7E               : 1;
    };

  struct
    {
    unsigned G4AS0E             : 1;
    unsigned G4AS1E             : 1;
    unsigned G4AS2E             : 1;
    unsigned G4AS3E             : 1;
    unsigned G4AS4E             : 1;
    unsigned G4AS5E             : 1;
    unsigned G4AS6E             : 1;
    unsigned G4AS7E             : 1;
    };
  } __COG4ASD1bits_t;

extern __at(0x089E) volatile __COG4ASD1bits_t COG4ASD1bits;

