OpenEPaperLink/OpenEPaperLink/ARM_Tag_FW/cc2531_OEPL/contiki/sdcc/non-free/include/pic14/pic16lf1777.h
extern __at(0x0915) __sfr CM6CON1;

typedef union
  {
  struct
    {
    unsigned INTN               : 1;
    unsigned INTP               : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    };

  struct
    {
    unsigned C6INTN             : 1;
    unsigned C6INTP             : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    };
  } __CM6CON1bits_t;

extern __at(0x0915) volatile __CM6CON1bits_t CM6CON1bits;

#define _CM6CON1_INTN           0x01
#define _CM6CON1_C6INTN         0x01
#define _CM6CON1_INTP           0x02
#define _CM6CON1_C6INTP         0x02

//==============================================================================


//==============================================================================
//        CM6NSEL Bits

extern __at(0x0916) __sfr CM6NSEL;

typedef union
  {
  struct
    {
    unsigned C6NCH0             : 1;
    unsigned C6NCH1             : 1;
    unsigned C6NCH2             : 1;
    unsigned C6NCH3             : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    };

  struct
    {
    unsigned C6NCH              : 4;
    unsigned                    : 4;
    };
  } __CM6NSELbits_t;

extern __at(0x0916) volatile __CM6NSELbits_t CM6NSELbits;

#define _C6NCH0                 0x01
#define _C6NCH1                 0x02
#define _C6NCH2                 0x04
#define _C6NCH3                 0x08

//==============================================================================


//==============================================================================
//        CM6PSEL Bits

extern __at(0x0917) __sfr CM6PSEL;

typedef union
  {
  struct
    {
    unsigned PCH0               : 1;
    unsigned PCH1               : 1;
    unsigned PCH2               : 1;
    unsigned PCH3               : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    };

  struct
    {
    unsigned C6PCH0             : 1;
    unsigned C6PCH1             : 1;
    unsigned C6PCH2             : 1;
    unsigned C6PCH3             : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    };

  struct
    {
    unsigned C6PCH              : 4;
    unsigned                    : 4;
    };

  struct
    {
    unsigned PCH                : 4;
    unsigned                    : 4;
    };
  } __CM6PSELbits_t;

extern __at(0x0917) volatile __CM6PSELbits_t CM6PSELbits;

#define _CM6PSEL_PCH0           0x01
#define _CM6PSEL_C6PCH0         0x01
#define _CM6PSEL_PCH1           0x02
#define _CM6PSEL_C6PCH1         0x02
#define _CM6PSEL_PCH2           0x04
#define _CM6PSEL_C6PCH2         0x04
#define _CM6PSEL_PCH3           0x08
#define _CM6PSEL_C6PCH3         0x08

//==============================================================================


//==============================================================================
//        CM7CON0 Bits

extern __at(0x0918) __sfr CM7CON0;

typedef union
  {
  struct
    {
    unsigned SYNC               : 1;
    unsigned HYS                : 1;
    unsigned Reserved           : 1;
    unsigned ZLF                : 1;
    unsigned POL                : 1;
    unsigned                    : 1;
    unsigned OUT                : 1;
    unsigned ON                 : 1;
    };

  struct
    {
    unsigned C7SYNC             : 1;
    unsigned C7HYS              : 1;
    unsigned C7SP               : 1;
    unsigned C7ZLF              : 1;
    unsigned C7POL              : 1;
    unsigned                    : 1;
    unsigned C7OUT              : 1;
    unsigned C7ON               : 1;
    };
  } __CM7CON0bits_t;

extern __at(0x0918) volatile __CM7CON0bits_t CM7CON0bits;

#define _CM7CON0_SYNC           0x01
#define _CM7CON0_C7SYNC         0x01
#define _CM7CON0_HYS            0x02
#define _CM7CON0_C7HYS          0x02
#define _CM7CON0_Reserved       0x04
#define _CM7CON0_C7SP           0x04
#define _CM7CON0_ZLF            0x08
#define _CM7CON0_C7ZLF          0x08
#define _CM7CON0_POL            0x10
#define _CM7CON0_C7POL          0x10
#define _CM7CON0_OUT            0x40
#define _CM7CON0_C7OUT          0x40
#define _CM7CON0_ON             0x80
#define _CM7CON0_C7ON           0x80

//==============================================================================


//==============================================================================
//        CM7CON1 Bits

extern __at(0x0919) __sfr CM7CON1;

typedef union
  {
  struct
    {
    unsigned INTN               : 1;
    unsigned INTP               : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    };

  struct
    {
    unsigned C7INTN             : 1;
    unsigned C7INTP             : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    };
  } __CM7CON1bits_t;

extern __at(0x0919) volatile __CM7CON1bits_t CM7CON1bits;

#define _CM7CON1_INTN           0x01
#define _CM7CON1_C7INTN         0x01
#define _CM7CON1_INTP           0x02
#define _CM7CON1_C7INTP         0x02

//==============================================================================


//==============================================================================
//        CM7NSEL Bits

extern __at(0x091A) __sfr CM7NSEL;

typedef union
  {
  struct
    {
    unsigned C7NCH0             : 1;
    unsigned C7NCH1             : 1;
    unsigned C7NCH2             : 1;
    unsigned C7NCH3             : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    };

  struct
    {
    unsigned C7NCH              : 4;
    unsigned                    : 4;
    };
  } __CM7NSELbits_t;

extern __at(0x091A) volatile __CM7NSELbits_t CM7NSELbits;

#define _C7NCH0                 0x01
#define _C7NCH1                 0x02
#define _C7NCH2                 0x04
#define _C7NCH3                 0x08

//==============================================================================


//==============================================================================
//        CM7PSEL Bits

extern __at(0x091B) __sfr CM7PSEL;

typedef union
  {
  struct
    {
    unsigned PCH0               : 1;
    unsigned PCH1               : 1;
    unsigned PCH2               : 1;
    unsigned PCH3               : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    };

  struct
    {
    unsigned C7PCH0             : 1;
    unsigned C7PCH1             : 1;
    unsigned C7PCH2             : 1;
    unsigned C7PCH3             : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    };

  struct
    {
    unsigned PCH                : 4;
    unsigned                    : 4;
    };

  struct
    {
    unsigned C7PCH              : 4;
    unsigned                    : 4;
    };
  } __CM7PSELbits_t;

extern __at(0x091B) volatile __CM7PSELbits_t CM7PSELbits;

#define _CM7PSEL_PCH0           0x01
#define _CM7PSEL_C7PCH0         0x01
#define _CM7PSEL_PCH1           0x02
#define _CM7PSEL_C7PCH1         0x02
#define _CM7PSEL_PCH2           0x04
#define _CM7PSEL_C7PCH2         0x04
#define _CM7PSEL_PCH3           0x08
#define _CM7PSEL_C7PCH3         0x08

//==============================================================================


//==============================================================================
//        CM8CON0 Bits

extern __at(0x091C) __sfr CM8CON0;

typedef union
  {
  struct
    {
    unsigned SYNC               : 1;
    unsigned HYS                : 1;
    unsigned Reserved           : 1;
    unsigned ZLF                : 1;
    unsigned POL                : 1;
    unsigned                    : 1;
    unsigned OUT                : 1;
    unsigned ON                 : 1;
    };

  struct
    {
    unsigned C8SYNC             : 1;
    unsigned C8HYS              : 1;
    unsigned C8SP               : 1;
    unsigned C8ZLF              : 1;
    unsigned C8POL              : 1;
    unsigned                    : 1;
    unsigned C8OUT              : 1;
    unsigned C8ON               : 1;
    };
  } __CM8CON0bits_t;

