OpenEPaperLink/OpenEPaperLink/ARM_Tag_FW/cc2531_OEPL/contiki/sdcc/non-free/include/pic14/pic16lf1777.h
#define _PWM11PRH0              0x01
#define _PWM11PRH1              0x02
#define _PWM11PRH2              0x04
#define _PWM11PRH3              0x08
#define _PWM11PRH4              0x10
#define _PWM11PRH5              0x20
#define _PWM11PRH6              0x40
#define _PWM11PRH7              0x80

//==============================================================================

extern __at(0x0DB7) __sfr PWM11OF;

//==============================================================================
//        PWM11OFL Bits

extern __at(0x0DB7) __sfr PWM11OFL;

typedef struct
  {
  unsigned PWM11OFL0            : 1;
  unsigned PWM11OFL1            : 1;
  unsigned PWM11OFL2            : 1;
  unsigned PWM11OFL3            : 1;
  unsigned PWM11OFL4            : 1;
  unsigned PWM11OFL5            : 1;
  unsigned PWM11OFL6            : 1;
  unsigned PWM11OFL7            : 1;
  } __PWM11OFLbits_t;

extern __at(0x0DB7) volatile __PWM11OFLbits_t PWM11OFLbits;

#define _PWM11OFL0              0x01
#define _PWM11OFL1              0x02
#define _PWM11OFL2              0x04
#define _PWM11OFL3              0x08
#define _PWM11OFL4              0x10
#define _PWM11OFL5              0x20
#define _PWM11OFL6              0x40
#define _PWM11OFL7              0x80

//==============================================================================


//==============================================================================
//        PWM11OFH Bits

extern __at(0x0DB8) __sfr PWM11OFH;

typedef struct
  {
  unsigned PWM11OFH0            : 1;
  unsigned PWM11OFH1            : 1;
  unsigned PWM11OFH2            : 1;
  unsigned PWM11OFH3            : 1;
  unsigned PWM11OFH4            : 1;
  unsigned PWM11OFH5            : 1;
  unsigned PWM11OFH6            : 1;
  unsigned PWM11OFH7            : 1;
  } __PWM11OFHbits_t;

extern __at(0x0DB8) volatile __PWM11OFHbits_t PWM11OFHbits;

#define _PWM11OFH0              0x01
#define _PWM11OFH1              0x02
#define _PWM11OFH2              0x04
#define _PWM11OFH3              0x08
#define _PWM11OFH4              0x10
#define _PWM11OFH5              0x20
#define _PWM11OFH6              0x40
#define _PWM11OFH7              0x80

//==============================================================================

extern __at(0x0DB9) __sfr PWM11TMR;

//==============================================================================
//        PWM11TMRL Bits

extern __at(0x0DB9) __sfr PWM11TMRL;

typedef struct
  {
  unsigned PWM11TMRL0           : 1;
  unsigned PWM11TMRL1           : 1;
  unsigned PWM11TMRL2           : 1;
  unsigned PWM11TMRL3           : 1;
  unsigned PWM11TMRL4           : 1;
  unsigned PWM11TMRL5           : 1;
  unsigned PWM11TMRL6           : 1;
  unsigned PWM11TMRL7           : 1;
  } __PWM11TMRLbits_t;

extern __at(0x0DB9) volatile __PWM11TMRLbits_t PWM11TMRLbits;

#define _PWM11TMRL0             0x01
#define _PWM11TMRL1             0x02
#define _PWM11TMRL2             0x04
#define _PWM11TMRL3             0x08
#define _PWM11TMRL4             0x10
#define _PWM11TMRL5             0x20
#define _PWM11TMRL6             0x40
#define _PWM11TMRL7             0x80

//==============================================================================


//==============================================================================
//        PWM11TMRH Bits

extern __at(0x0DBA) __sfr PWM11TMRH;

typedef struct
  {
  unsigned PWM11TMRH0           : 1;
  unsigned PWM11TMRH1           : 1;
  unsigned PWM11TMRH2           : 1;
  unsigned PWM11TMRH3           : 1;
  unsigned PWM11TMRH4           : 1;
  unsigned PWM11TMRH5           : 1;
  unsigned PWM11TMRH6           : 1;
  unsigned PWM11TMRH7           : 1;
  } __PWM11TMRHbits_t;

extern __at(0x0DBA) volatile __PWM11TMRHbits_t PWM11TMRHbits;

#define _PWM11TMRH0             0x01
#define _PWM11TMRH1             0x02
#define _PWM11TMRH2             0x04
#define _PWM11TMRH3             0x08
#define _PWM11TMRH4             0x10
#define _PWM11TMRH5             0x20
#define _PWM11TMRH6             0x40
#define _PWM11TMRH7             0x80

//==============================================================================


//==============================================================================
//        PWM11CON Bits

extern __at(0x0DBB) __sfr PWM11CON;

typedef union
  {
  struct
    {
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned PWM11MODE0         : 1;
    unsigned PWM11MODE1         : 1;
    unsigned POL                : 1;
    unsigned OUT                : 1;
    unsigned                    : 1;
    unsigned EN                 : 1;
    };

  struct
    {
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned MODE0              : 1;
    unsigned MODE1              : 1;
    unsigned PWM11POL           : 1;
    unsigned PWM11OUT           : 1;
    unsigned                    : 1;
    unsigned PWM11EN            : 1;
    };

  struct
    {
    unsigned                    : 2;
    unsigned PWM11MODE          : 2;
    unsigned                    : 4;
    };

  struct
    {
    unsigned                    : 2;
    unsigned MODE               : 2;
    unsigned                    : 4;
    };
  } __PWM11CONbits_t;

extern __at(0x0DBB) volatile __PWM11CONbits_t PWM11CONbits;

#define _PWM11CON_PWM11MODE0    0x04
#define _PWM11CON_MODE0         0x04
#define _PWM11CON_PWM11MODE1    0x08
#define _PWM11CON_MODE1         0x08
#define _PWM11CON_POL           0x10
#define _PWM11CON_PWM11POL      0x10
#define _PWM11CON_OUT           0x20
#define _PWM11CON_PWM11OUT      0x20
#define _PWM11CON_EN            0x80
#define _PWM11CON_PWM11EN       0x80

//==============================================================================


//==============================================================================
//        PWM11INTCON Bits

extern __at(0x0DBC) __sfr PWM11INTCON;

typedef union
  {
  struct
    {
    unsigned PRIE               : 1;
    unsigned DCIE               : 1;
    unsigned PHIE               : 1;
    unsigned OFIE               : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    };

  struct
    {
    unsigned PWM11PRIE          : 1;
    unsigned PWM11DCIE          : 1;
    unsigned PWM11PHIE          : 1;
    unsigned PWM11OFIE          : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    };
  } __PWM11INTCONbits_t;

extern __at(0x0DBC) volatile __PWM11INTCONbits_t PWM11INTCONbits;

