OpenEPaperLink/OpenEPaperLink/ARM_Tag_FW/cc2531_OEPL/contiki/sdcc/non-free/include/pic14/pic16lf1777.h
extern __at(0x0DBF) __sfr PWM11LDCON;

typedef union
  {
  struct
    {
    unsigned PWM11LDS0          : 1;
    unsigned PWM11LDS1          : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned LDT                : 1;
    unsigned LDA                : 1;
    };

  struct
    {
    unsigned LDS0               : 1;
    unsigned LDS1               : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned PWM11LDM           : 1;
    unsigned PWM11LD            : 1;
    };

  struct
    {
    unsigned PWM11LDS           : 2;
    unsigned                    : 6;
    };

  struct
    {
    unsigned LDS                : 2;
    unsigned                    : 6;
    };
  } __PWM11LDCONbits_t;

extern __at(0x0DBF) volatile __PWM11LDCONbits_t PWM11LDCONbits;

#define _PWM11LDCON_PWM11LDS0   0x01
#define _PWM11LDCON_LDS0        0x01
#define _PWM11LDCON_PWM11LDS1   0x02
#define _PWM11LDCON_LDS1        0x02
#define _PWM11LDCON_LDT         0x40
#define _PWM11LDCON_PWM11LDM    0x40
#define _PWM11LDCON_LDA         0x80
#define _PWM11LDCON_PWM11LD     0x80

//==============================================================================


//==============================================================================
//        PWM11OFCON Bits

extern __at(0x0DC0) __sfr PWM11OFCON;

typedef union
  {
  struct
    {
    unsigned PWM11OFS0          : 1;
    unsigned PWM11OFS1          : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned OFO                : 1;
    unsigned PWM11OFM0          : 1;
    unsigned PWM11OFM1          : 1;
    unsigned                    : 1;
    };

  struct
    {
    unsigned OFS0               : 1;
    unsigned OFS1               : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned PWM11OFMC          : 1;
    unsigned OFM0               : 1;
    unsigned OFM1               : 1;
    unsigned                    : 1;
    };

  struct
    {
    unsigned PWM11OFS           : 2;
    unsigned                    : 6;
    };

  struct
    {
    unsigned OFS                : 2;
    unsigned                    : 6;
    };

  struct
    {
    unsigned                    : 5;
    unsigned OFM                : 2;
    unsigned                    : 1;
    };

  struct
    {
    unsigned                    : 5;
    unsigned PWM11OFM           : 2;
    unsigned                    : 1;
    };
  } __PWM11OFCONbits_t;

extern __at(0x0DC0) volatile __PWM11OFCONbits_t PWM11OFCONbits;

#define _PWM11OFCON_PWM11OFS0   0x01
#define _PWM11OFCON_OFS0        0x01
#define _PWM11OFCON_PWM11OFS1   0x02
#define _PWM11OFCON_OFS1        0x02
#define _PWM11OFCON_OFO         0x10
#define _PWM11OFCON_PWM11OFMC   0x10
#define _PWM11OFCON_PWM11OFM0   0x20
#define _PWM11OFCON_OFM0        0x20
#define _PWM11OFCON_PWM11OFM1   0x40
#define _PWM11OFCON_OFM1        0x40

//==============================================================================

extern __at(0x0DC1) __sfr PWM12PH;

//==============================================================================
//        PWM12PHL Bits

extern __at(0x0DC1) __sfr PWM12PHL;

typedef struct
  {
  unsigned PWM12PHL0            : 1;
  unsigned PWM12PHL1            : 1;
  unsigned PWM12PHL2            : 1;
  unsigned PWM12PHL3            : 1;
  unsigned PWM12PHL4            : 1;
  unsigned PWM12PHL5            : 1;
  unsigned PWM12PHL6            : 1;
  unsigned PWM12PHL7            : 1;
  } __PWM12PHLbits_t;

extern __at(0x0DC1) volatile __PWM12PHLbits_t PWM12PHLbits;

#define _PWM12PHL0              0x01
#define _PWM12PHL1              0x02
#define _PWM12PHL2              0x04
#define _PWM12PHL3              0x08
#define _PWM12PHL4              0x10
#define _PWM12PHL5              0x20
#define _PWM12PHL6              0x40
#define _PWM12PHL7              0x80

//==============================================================================


//==============================================================================
//        PWM12PHH Bits

extern __at(0x0DC2) __sfr PWM12PHH;

typedef struct
  {
  unsigned PWM12PHH0            : 1;
  unsigned PWM12PHH1            : 1;
  unsigned PWM12PHH2            : 1;
  unsigned PWM12PHH3            : 1;
  unsigned PWM12PHH4            : 1;
  unsigned PWM12PHH5            : 1;
  unsigned PWM12PHH6            : 1;
  unsigned PWM12PHH7            : 1;
  } __PWM12PHHbits_t;

extern __at(0x0DC2) volatile __PWM12PHHbits_t PWM12PHHbits;

#define _PWM12PHH0              0x01
#define _PWM12PHH1              0x02
#define _PWM12PHH2              0x04
#define _PWM12PHH3              0x08
#define _PWM12PHH4              0x10
#define _PWM12PHH5              0x20
#define _PWM12PHH6              0x40
#define _PWM12PHH7              0x80

//==============================================================================

extern __at(0x0DC3) __sfr PWM12DC;

//==============================================================================
//        PWM12DCL Bits

extern __at(0x0DC3) __sfr PWM12DCL;

typedef struct
  {
  unsigned PWM12DCL0            : 1;
  unsigned PWM12DCL1            : 1;
  unsigned PWM12DCL2            : 1;
  unsigned PWM12DCL3            : 1;
  unsigned PWM12DCL4            : 1;
  unsigned PWM12DCL5            : 1;
  unsigned PWM12DCL6            : 1;
  unsigned PWM12DCL7            : 1;
  } __PWM12DCLbits_t;

extern __at(0x0DC3) volatile __PWM12DCLbits_t PWM12DCLbits;

#define _PWM12DCL0              0x01
#define _PWM12DCL1              0x02
#define _PWM12DCL2              0x04
#define _PWM12DCL3              0x08
#define _PWM12DCL4              0x10
#define _PWM12DCL5              0x20
#define _PWM12DCL6              0x40
#define _PWM12DCL7              0x80

//==============================================================================


//==============================================================================
//        PWM12DCH Bits

extern __at(0x0DC4) __sfr PWM12DCH;

typedef struct
  {
  unsigned PWM12DCH0            : 1;
  unsigned PWM12DCH1            : 1;
  unsigned PWM12DCH2            : 1;
  unsigned PWM12DCH3            : 1;
  unsigned PWM12DCH4            : 1;
  unsigned PWM12DCH5            : 1;
  unsigned PWM12DCH6            : 1;
  unsigned PWM12DCH7            : 1;
  } __PWM12DCHbits_t;

extern __at(0x0DC4) volatile __PWM12DCHbits_t PWM12DCHbits;

#define _PWM12DCH0              0x01
#define _PWM12DCH1              0x02
#define _PWM12DCH2              0x04
#define _PWM12DCH3              0x08
#define _PWM12DCH4              0x10
#define _PWM12DCH5              0x20
#define _PWM12DCH6              0x40
#define _PWM12DCH7              0x80

//==============================================================================

